In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('lecture10.csv')
data

   ID  val1  val2
0   1  12.0  33.0
1   2   NaN  44.0
2   3  16.0  55.0
3   4   NaN  66.0
4   5  20.0   NaN
5   6  22.0   NaN
6   7  24.0  99.0

In [4]:
df = pd.read_csv('lecture10.csv')
df.fillna(0, inplace=True)
df

   ID  val1  val2
0   1  12.0  33.0
1   2   0.0  44.0
2   3  16.0  55.0
3   4   0.0  66.0
4   5  20.0   0.0
5   6  22.0   0.0
6   7  24.0  99.0

In [8]:
df.isnull()

      ID   val1   val2
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False

In [11]:
df[df['val2'].isnull()]

Empty DataFrame
Columns: [ID, val1, val2]
Index: []

In [10]:
df['val2'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
Name: val2, dtype: bool